Revit 2027 API
BuiltInFailures.AssemblyFailures.ElementsNotAllowedAreNotAddedToAssembly Property
 Elements not allowed in Assembly were not added to it, but only in the document
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementsNotAllowedAreNotAddedToAssembly { get; }
Public Shared ReadOnly Property ElementsNotAllowedAreNotAddedToAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementsNotAllowedAreNotAddedToAssembly {
	FailureDefinitionId^ get ();
}
static member ElementsNotAllowedAreNotAddedToAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace